Table of Contents
 Interface IIdeaCrossSectionByCenterLine
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
A cross-section of a general cold formed profile defined by it's center line.
public interface IIdeaCrossSectionByCenterLine : IIdeaCrossSection, IIdeaObject
Inherited Members
 IIdeaCrossSection.Rotation
 IIdeaCrossSection.IsInPrincipal
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 CenterLine
Center line
PolyLine2D CenterLine { get; }
Property Value
PolyLine2D
 Material
Material of the cross-section.
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 Radius
Radius
double Radius { get; }
Property Value
double
 Thickness
Thickness
double Thickness { get; }
Property Value
double
 Type
Type of the cross-section.
CrossSectionType Type { get; }
Property Value
CrossSectionType
 Edit this page